Documents/СтопФакторыБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>СтопФакторыБанков</Name>
			<BasedOn>
				<xr:Item>Document.СтопФакторыБанков</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтопФакторыБанков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтопФакторыБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСтопФакторы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИпотечныйБанк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловияКредитования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеКредитования</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПримененияСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>cfg:CatalogRef.ПараметрыПримененияСтавок_Значения</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтопФакторыБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СтопФакторыБанков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИпотечныйБанк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеКредитования</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПримененияСтавок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>cfg:CatalogRef.ПараметрыПримененияСтавок_Значения</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийСтопФакторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСтопФакторы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Установка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СтопФакторыБанков/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ВидОперации = Перечисления.ВидыОперацийСтопФакторы.Отмена Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
			Отказ=Истина;
			Возврат;
		КонецЕсли;
	СнятьАктивностьПредыдущих();
	Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.СтопФакторыБанков.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Ссылка);
	Набор.Прочитать();

	Для Каждого ТекСтрокаУсловияКредитования Из УсловияКредитования Цикл
		Движение = Набор.Добавить();
		Движение.Период = ДатаРегистрации;
		Движение.ИпотечныйБанк = ИпотечныйБанк;
		Движение.УсловиеКредитования = ТекСтрокаУсловияКредитования.УсловиеКредитования;
		Движение.Значение = ТекСтрокаУсловияКредитования.Значение;
		Движение.Группа = ТекСтрокаУсловияКредитования.Группа;
		Движение.Активен = Истина;
	КонецЦикла;

	Набор.Записать();
	
КонецПроцедуры


Процедура СнятьАктивностьПредыдущих()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтопФакторыБанков.Период,
	|	СтопФакторыБанков.Регистратор,
	|	СтопФакторыБанков.НомерСтроки,
	|	СтопФакторыБанков.Активность,
	|	СтопФакторыБанков.ИпотечныйБанк,
	|	СтопФакторыБанков.УсловиеКредитования,
	|	СтопФакторыБанков.Значение,
	|	СтопФакторыБанков.Группа,
	|	СтопФакторыБанков.Активен
	|ИЗ
	|	РегистрСведений.СтопФакторыБанков КАК СтопФакторыБанков
	|ГДЕ
	|	СтопФакторыБанков.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Набор = РегистрыСведений.СтопФакторыБанков.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Ссылка);
	Набор.Прочитать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи,,"Регистратор, Период");		
		Запись.Активен = Ложь;
		Запись.Период = ДатаРегистрации;
	КонецЦикла;
	
	Набор.Записать();

	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СтопФакторыБанков") Тогда
		// Заполнение шапки
		ВидОперации = Перечисления.ВидыОперацийСтопФакторы.Отмена;
		ИпотечныйБанк = ДанныеЗаполнения.ИпотечныйБанк;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаУсловияКредитования Из ДанныеЗаполнения.УсловияКредитования Цикл
			НоваяСтрока = УсловияКредитования.Добавить();
			НоваяСтрока.Группа = ТекСтрокаУсловияКредитования.Группа;
			НоваяСтрока.Значение = ТекСтрокаУсловияКредитования.Значение;
			НоваяСтрока.УсловиеКредитования = ТекСтрокаУсловияКредитования.УсловиеКредитования;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
